In [1]:
#Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

#Check the number of rentals for each customer for May

#Check the number of rentals for each customer for June

In [2]:
import pandas as pd
import sqlalchemy as alch

In [3]:
from getpass import getpass
password = getpass("Introduce your sql password: ")

Introduce your sql password: ········

In [4]:
dbName="sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

In [ ]:
#Check the number of rentals for each customer for May

In [14]:
df_may = pd.read_sql_query(
"""
select customer_id, count(rental_id)as num_films
FROM rentals_may
group by customer_id;

""", engine
)
print (df_may)

     customer_id  num_films
0            130          2
1            459          1
2            408          3
3            333          1
4            222          5
..           ...        ...
515          191          2
516          351          1
517           10          1
518          136          1
519           61          1

[520 rows x 2 columns]

In [ ]:
#Check the number of rentals for each customer for June

In [13]:
df_june = pd.read_sql_query(
"""
select customer_id, count(rental_id)as num_films
FROM rentals_june
group by customer_id;

""", engine
)
print (df_june)

     customer_id  num_films
0            416          5
1            516          6
2            239          5
3            285          3
4            310          6
..           ...        ...
585          412          1
586          335          1
587          226          2
588           22          1
589          126          1

[590 rows x 2 columns]

In [15]:

#Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

#Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

In [17]:
df= pd.merge(df_may,df_june,on="customer_id")

In [18]:
df.head()

   customer_id  num_films_x  num_films_y
0          130            2            6
1          459            1            7
2          408            3            3
3          333            1            4
4          222            5            2

In [19]:
df= df.rename(columns={"num_films_x":"num_films_may","num_films_y":"num_films_june"})

In [20]:
df.head()

   customer_id  num_films_may  num_films_june
0          130              2               6
1          459              1               7
2          408              3               3
3          333              1               4
4          222              5               2

In [25]:
def comparison (row):
    if row["num_films_may"]> row ["num_films_june"]:
        return "customer rented more films in may than june"
    elif row["num_films_may"]< row ["num_films_june"]:
        return "customer rented more films in june than may" 
    else:    
        return "same films"

In [26]:
df["comparison"]=df.apply(lambda row: comparison(row), axis=1)

In [27]:
df.head()

,customer_id,num_films_may,num_films_june,comparison
0,130,2,6,customer rented more films in june than may
1,459,1,7,customer rented more films in june than may
2,408,3,3,same films
3,333,1,4,customer rented more films in june than may
4,222,5,2,customer rented more films in may than june